20250612T231654--kdoc-388-『仕事ですぐに使えるtypescript』__draft_book.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-14T18:23:31Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 388: 『仕事ですぐに使えるTypeScript』</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 388: 『仕事ですぐに使えるTypeScript』</h1>
<div id="outline-container-org901583b" class="outline-2">
<h2 id="org901583b"><a href="#org901583b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org901583b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>

<ul class="org-ul">
<li>レビュー
<ul class="org-ul">
<li class="off"><input type='checkbox' /> &lt;署名&gt;</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orge2da92d" class="outline-2">
<h2 id="orge2da92d"><a href="#orge2da92d">概要</a></h2>
<div class="outline-text-2" id="text-orge2da92d">
<p>
<a href="https://future-architect.github.io/typescript-guide/typescript-guide.pdf">仕事ですぐに使えるTypeScript</a>は、TypeScriptの入門本。
</p>
</div>
</div>
<div id="outline-container-orgc176077" class="outline-2">
<h2 id="orgc176077"><a href="#orgc176077">メモ</a></h2>
<div class="outline-text-2" id="text-orgc176077">
<ul class="org-ul">
<li>Babelを使用して最新のJavaScriptから互換性の高いJavaScriptへの変換を行う(p5)</li>
<li>(疑問)型定義 <b>ファイル</b> が同時生成できて無駄がない、とあるが、別個のファイルなのだろうか(p5)
<ul class="org-ul">
<li>ゼロからTypeScriptでいけば、型定義ファイルは自動生成される(p6)</li>
</ul></li>
<li>TypeScriptの型はほかの型付き言語と比べて柔軟である。型システムがプログラミングのサポートの機能しかなく、静的なメモリ配置まで面倒を見るような言語とは異なる(p21)</li>
<li>numberは2進数で表した数値表現なので、0.2+0.1などのようにきれいに2進数で表せない数値は誤差が出てしまう(p28)</li>
<li>Javascriptはエンコード方式としてUTF-16を採用している(p32)</li>
<li>Reactは1行のreturn文のなかで仮想DOMという巨大なJavaScriptオブジェクトを生成する。そこで参考演算子が役立つ(p57)</li>
<li>TypeScriptのソースコードはあくまでもJavaScriptに変換されてから実行される。TypeScriptのコンパイラが持つインターフェースやtypeなど固有の型情報はランタイムには存在しない。そのため「このオブジェクトがこのインターフェースを持つとき」という実行文はほかの言語のようにそのまま実行できない(p68)</li>
<li>TypeScriptはそれを解決するために型ガードという機能が実装されている。実行時の文脈を解析し、型の選択肢を適切に絞り込んでいく。コンパイラはtypeofやinstanceofなどを見て型ガードと判定する、という(p68)</li>
<li>(感想)なぜtypeofは文字列で返すのだろうか。型ガードがある理由と同じようにランタイムにまつわるものだろうか。TypeScriptの層で吸収できそうにも見える</li>
<li>型ガードではTypeScriptのコンパイラだけが知っている情報は扱えない。JavaScriptとして実行時にアクセスできる情報を使って、booleanを返す必要がある(p70)</li>
<li>型アサーションは実行文ではなく、あくまでコンパイラの持つ型情報を上書きするものである。型ガードと異なり、実行時には一切参照しない(p70)</li>
<li>従来のJavaScriptは関数の使い勝手がよかったいっぽうで、言語の他の機能は少なかった。関数を多用したテクニックが多くあった(p75)</li>
<li>実行時の親子関係ではなく、ソースコードという定義時の親子関係を元にしてスコープが決定されることをレキシカルスコープという(p82)
<ul class="org-ul">
<li>(感想)今まで見た説明のなかでもっともわかりやすい説明</li>
<li>(感想)逆に実行時に決まるのがダイナミックスコープ</li>
</ul></li>
<li>自分が定義された場所の外の変数を束縛した関数をクロージャという(p82)</li>
<li><code>this</code> は変数ではなく、特別な識別子である。レキシカルスコープで束縛できない。クロージャかつ、 <code>this</code> への束縛ができる新文法としてアロー関数が追加された。無名関数をコールバック関数に渡そうとすると <code>this</code> がわからなくなってしまう問題がある。アロー関数を使うとその関数が定義された場所の <code>this</code> の保持までセットで行う。アロー関数が出る以前は <code>this</code> がなくなってしまうため別の名前に退避させていた(p82)</li>
<li>TypeScriptのDateは数字に毛の生えたようなものである、という(p88)</li>
<li>ブラウザにはperformance.now()という高精度タイマーがあったが、セキリュティの懸念で現在は精度が落とされていてDate.now()とあまり変わらない(p88)
<ul class="org-ul">
<li>(感想)どういうことなのだろう</li>
</ul></li>
<li>ブラウザはユーザインターフェースであるため、ユーザの利用環境のタイムゾーン情報を持っている。しかし多くのユーザの情報を同時に扱うサーバではタイムゾーン情報も含めて扱うのは手間がかかる。なので、サーバーでは常にエポック時刻で扱うようにする。クライアントがサーバに送信するときはエポック時刻にして送信する。クライアント側でローカル時刻化する。を指針にするとよい(p89)</li>
<li>スリープのような、実行を行の途中で止めるような処理は基本的にもっていなかった。10秒後に実行される関数を登録する、といった処理が提供され、「10秒止める」という処理を書く機能は提供されなかった。JavaScriptは伝統的に、ホストとなる環境(ブラウザ)のなかで実行される、アプリケーション言語として使われることが多かった。ホスト側のアプリケーションから見て長時間ブロックされるなどの行儀の悪い動きをするのが忌避されてきた(p123)</li>
<li>ブラウザでは数々のHTMLのインタラクション、タイマーなどのイベントに対してあらかじめ登録しておいたイベントハンドラの関数が呼ばれる、というモデルを採用している(p123)</li>
<li>現在見かける非同期処理の書き方は3種類ある(p123)
<ul class="org-ul">
<li>コールバック</li>
<li>Promise</li>
<li>async / await</li>
</ul></li>
<li>基本的にループ内のawaitは警戒すべきコードである。ループごとに待つから(p128)
<ul class="org-ul">
<li>Promise.all()を使うと、同時実行して引数の配列すべての処理が終わるのを待つ、を表現できる</li>
</ul></li>
<li>以前のJavaScriptは公式には複数のファイルに分割してコーディングする方法を提供していなかった。当初はClosure Compiler、ライブラリごとの固有のファイル結合ツール、require.jsなどを使っていた。そのあとNode.jsが登場しCommonJSというサーバーサイドJavaScriptのための仕様から取り込まれたモジュールシステムがデファクトスタンダードとなった。ブラウザからは利用しにくい仕様だったため、ブラウザからも利用できるES2015 modulesが仕様化された(p143)</li>
<li>ES2015 modules が仕様化されたといっても、これだけでは完結しない。通常はダウンロードをまとめて行うために事前にバンドラーツールで1ファイルにまとめつつ最適化する。ライブラリの流通の仕組みがNode.jsのエコシステムであるnpmjs.orgで行われることもあって、ライブラリの多くがCommonJS形式で提供されている。なのでCommonJSとも連携が必要である(p151)</li>
<li>TypeScriptはインポートしたものが型だけの場合に、出力からそのインポート文を丸ごと排除する。なので副作用のコードは実行されない(p152)</li>
<li>副作用なく型のインポートのみを許容する構文がある(p153)</li>
<li>型による実装の分岐はできない。JavaScriptにないことはできない(p162)</li>
</ul>
</div>
</div>
<div id="outline-container-org14fe47a" class="outline-2">
<h2 id="org14fe47a"><a href="#org14fe47a">関連</a></h2>
<div class="outline-text-2" id="text-org14fe47a">
<p>
なし。
</p>
</div>
</div>
<div id="outline-container-orgd382dd7" class="outline-2">
<h2 id="orgd382dd7"><a href="#orgd382dd7">Backlinks</a></h2>
<div class="outline-text-2" id="text-orgd382dd7">
<ul class="org-ul">
<li><a href="./20250603T215644--kdoc-383-javascriptはブラウザの組み込み言語でありランタイムの更新は難しい__permanent.html">KDOC 383: JavaScriptはブラウザの組み込み言語でありランタイムの更新は難しい</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
